Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ། ལོངས་སྤྱོད་ཆེ་བ་ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་མཉམ་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་རིགས་མཉམ་པ་ལས་ཆུང་མ་བླངས་ཏེ
en: When the Blessed One was in Śrāvastī, there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s. He took a wife of the same caste,

source: དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ཏེ།
en: and as they enjoyed themselves and coupled, one day his wife conceived.

source: སེམས་ཅན་དེ་ཡང་སྲིད་པ་ཐ་མ་པ་ཞིག་ཡིན་ལ།
en: Now, that being was in its final existence.

source: ཁྱིམ་དེའི་བསེན་ནི་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ཡིན་ཏེ།
en: The spiritual friend of the house was Venerable Aniruddha,

source: དེས་བལྟས་ན་སྲིད་པ་ཐ་མ་པའི་སེམས་ཅན་གྱིས་ཁྱིམ་དེར་ཉིང་མཚམས་སྦྱར་བར་མཐོང་ངོ་། །
en: and he looked and saw that a being in its final existence had taken rebirth in their house.

source: དེ་ནས་དེས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེ་བརྟན་པོར་བྱ་བའི་ཕྱིར། གཅིག་པུ་ཟླ་མེད་ཅིང་གཡོག་མེད་པར་ཁྱིམ་དེར་སོང་བ་དང་།
en: One day, to strengthen the parents’ resolve, Venerable Aniruddha went to their house alone, without companions or attendants.

source: ཁྱིམ་བདག་དེས་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་མཐོང་ནས་སྨྲས་པ།
en: Upon seeing Venerable Aniruddha, the householder said,

source: འཕགས་པ་ཁྱོད་ཞམ་རིང་མ་མཆིས་སམ་ཅི་ན། ཟླ་མ་མཆིས་པ་དང་ཞབས་འབྲིང་མ་མཆིས་པར་གཅིག་པུ་གཤེགས།
en: “Noble one, why have you come here alone, without companions or attendants?”

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་སྨྲས་པ། བདག་ཅག་གི་གཡོག་ནི་ཁྱེད་ཅག་ལྟ་བུ་འབའ་ཞིག་གིས་བྱིན་པ་དེ་དག་བདག་ཅག་གི་གཡོག་ཏུ་འགྱུར་བར་ཟད་པས་ན། བདག་ཅག་གི་གཡོག་ནི་རྙེད་རྙེད་ཙམ་དུ་ཟད་དོ། །
en: “Where shall we find attendants,” Venerable Aniruddha replied, “if one such as yourself does not grant them to us?”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། འཕགས་པ་བདག་གི་མཆིས་བྲང་ལ་བུ་ཆགས་པ་མཆིས་ཀྱིས་དེ་ལས་གལ་ཏེ་ཁྱེའུ་ཞིག་བཙས་པར་གྱུར་ན། དེ་བདག་གིས་འཕགས་པའི་ཞབས་འབྲིང་དུ་དབུལ་ལོ། །
en: “Noble one,” the householder said, “my wife has conceived, so if we have a son, noble one, I shall offer him to you as an attendant.”

source: མ་འགགས་པས་སྨྲས་པ། ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ནོ་ཞེས་སྨྲས་ནས་སོང་ངོ་། །
en: Venerable Aniruddha said, “The virtuous keep their promises.”

source: ཁྱིམ་བདག་གི་ཆུང་མ་དེ་ཡང་གང་གི་ཚེ་བུ་ཆགས་པར་གྱུར་ནས།
en: Having spoken thus, Venerable Aniruddha departed.

source: གཅིག་པུ་ཤིན་ཏུ་དབེན་པའི་ཕྱོགས་སུ་སོང་ནས་གནས་པར་བྱེད་དེ།
en: After the householder’s wife conceived, she went to a very isolated place and stayed there,

source: ཕྱིན་ཅད་སྐྱེ་བོ་མང་པོའི་ནང་དུ་འདུག་པར་མི་དགའོ། །
en: for she was perpetually unhappy in the company of others.

source: དེ་ནས་ཁྱིམ་བདག་གིས་བསམས་པ།
en: The householder thought,

source: མ་ལ་བདག་གི་ཆུང་མ་འདི་འབྱུང་པོ་འགའ་ཞིག་གིས་མ་བརླམས་གྲང་སྙམ་ནས་ལྟས་མཁན་རྣམས་ལ་བསྟན་ནས་
en: “Has my wife been possessed by some sort of spirit?” and he brought her to the soothsayers.

source: ལྟས་མཁན་རྣམས་ཀྱིས་སྨྲས་པ། འདི་འབྱུང་པོས་བརླམས་པ་ནི་མ་ཡིན་གྱི་འདི་ནི་སེམས་ཅན་ལྟོ་ན་འདུག་པ་དེའི་མཐུ་ཡིན་ཏེ
en: “No,” the soothsayers assured him, “she has not been possessed by a spirit. All this has taken place on account of the being in her womb.

source: སེམས་ཅན་དེ་ནི་གཅིག་པུ་གར་བར་དགའ་བ་ཞིག་གོ་ཞེས་བྱས་སོ། །
en: That being is happy to be by himself.”

source: དེ་ནས་ཁྱིམ་བདག་གི་ཆུང་མ་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ་གསེར་གྱི་ཁ་དོག་ཅན་མགོ་བོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ་དཔྲལ་བའི་དབྱེས་ཆེ་བ་སྣ་མཐོ་བ་སྣ་ལེགས་པ་ཞིག་བཙས་ཏེ
en: Then, after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with glowing, golden skin and a well-rounded head, long arms, a broad brow, and a nose fine and prominent.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ།
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?”

source: ཁྱེའུ་འདི་མ་བཙས་པའི་སྔ་རོལ་ནས་གཅིག་པུ་གར་བར་དགའ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདིའི་མིང་དགོན་པ་པ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: And they named him, saying, “Since it was predicted before he was born that he would be happy to be by himself, his name will be Āraṇyaka.”

source: དེ་ནས་ཁྱེའུ་དགོན་པ་པ་དེ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས་འགྲོ་བར་ནུས་པར་གྱུར་པ་དང་། ཁྱེའུ་དེ་རང་བཞིན་གྱིས་ཚེ་རབས་དྲན་ཏེ
en: They reared young Āraṇyaka on milk, yogurt, butter, ghee, and milk solids, and once he was able to walk, he naturally began to recall his former lives.

source: དེས་བལྟས་ན་འཁོར་བར་འཁོར་བ་ན་བདག་གིས་འདུ་འཛིའི་ཉེས་པས་སྡུག་བསྔལ་ཆེན་པོ་མྱོང་བར་མཐོང་ངོ་། །
en: When he looked, he saw that he had been circling in saṃsāra, where, caught up in socializing, he met with great suffering.

source: མཐོང་ནས་ཀྱང་གཅིག་པུ་ཤིན་ཏུ་དབེན་པའི་ཕྱོགས་སུ་དགའ་བར་བྱེད་ཅིང་དེ་འདུ་འཛིའི་ཉེས་པ་སྤང་བའི་ཕྱིར་གནས་སོ། །
en: Recognizing this, he was happy to stay by himself in isolated places and avoid such socializing distractions.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་མ་འགགས་པས་དེ་རབ་ཏུ་བྱུང་བའི་དུས་ལ་བབ་པར་ཤེས་ནས་ཁྱིམ་བདག་དེ་ལ་སྨྲས་པ།
en: One day Venerable Aniruddha knew that the time had come for the child to go forth, so he reminded the householder,

source: ཁྱིམ་བདག་ཁྱེའུ་འདི་ནི་མ་བཙས་པའི་སྔ་རོལ་ནས། ཁྱོད་ཀྱིས་བདག་ལ་གཡོག་ཏུ་བྱིན་ཏེ།
en: “Householder, before this child was born you granted him to me as an attendant.

source: ཁོང་དགེ་བ་རྣམས་ནི་དམ་བཅས་པ་ལ་བརྟན་པ་ཡིན་ན་དེ་ཁོ་ན་ལྟར་དམ་མ་བཅས་སམ།
en: The virtuous keep their promises, do they not? Didn’t you yourself make such a promise?”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། འཕགས་པ་དེ་ཁོ་ན་ལྟར་དམ་བཅས་ལགས་སོ་ཞེས་བྱས་ནས། ཁྱེའུ་དེ་ལག་པ་གཉིས་ཀྱིས་བཟུང་སྟེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པ་ལ་ཕུལ་ནས་སྨྲས་པ།
en: “Yes, noble one, I did make just such a promise,” the householder replied, and as he said this, he took the child by his two hands, offered him to Venerable Aniruddha, and told him,

source: བུ་ཁྱོད་མ་བཙས་པའི་སྔ་རོལ་ནས་འཕགས་པའི་ཞབས་འབྲིང་དུ་ཕུལ་གྱིས་སོང་ལ་འཕགས་པའི་ཞབས་འབྲིང་གྱིས་ཤིག །
en: “Child, before you were born, I offered you to the noble one. Therefore go, and be an attendant of the noble one.”

source: ཁྱེའུས་སྨྲས་པ། དེ་ནི་བདག་ལ་ཕན་གདགས་པ་ལགས་སོ་ཞེས་བྱས་ནསཁྱེའུ་དེ་ཚེ་དང་ལྡན་པ་མ་འགགས་པའི་ཕྱི་བཞིན་སོང་ངོ་། །
en: “This will be of benefit to me,” the child said, and with those words he followed Venerable Aniruddha away.

source: ཚེ་དང་ལྡན་པ་མ་འགགས་པས་ཀྱང་། ཁྱིམ་བདག་དེ་ལ་ཆོས་བཤད་ནས་ཁྱེའུ་དེ་ཁྲིད་དེ་གཙུག་ལག་ཁང་དུ་སོང་ངོ་། །
en: Venerable Aniruddha explained the Dharma to the householder and then brought the child to the monastery.

source: དེར་ཁྲིད་ནས་ཀྱང་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: There he led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: རིག་པ་དང་། མངོན་པར་ཤེས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ།
en: He achieved the insights, superknowledges, and discriminations.

source: སྲིད་པའི་རྙེད་པ་དང་ཆགས་པ་དང་བཀུར་སྟི་ལ་མི་ལྟ་བ་དབང་པོ་དང་ཉེ་དབང་དང་བཅས་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་ཅིང་རྗེད་པ་དང་གུས་པར་སྨྲ་བའི་གནས་སུ་གྱུར་ཏོ། །
en: He had no regard for worldly profit, passion, or acclaim. He became an object of offering, veneration, and respectful address by Indra, Upendra, and the other gods.

source: དེ་དགོན་པ་དང་ནགས་ཁྲོད་དང་བས་མཐའི་གནས་མལ་ལ་རྟེན་ཅིང་། བདག་སུ་དང་ཡང་མི་ཕྲད་པར་བྱའོ་སྙམ་མོ། །
en: “By staying in seclusion—in hermitages, in forests, and in remote places—I shall not come into contact with anyone,” he thought.

source: དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: The monks inquired of the Blessed Buddha,

source: བཙུན་པ་དགོན་པ་བས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ནས
en: “Lord, what action did Āraṇyaka take that ripened into his birth into a family of great means, prosperity, and wealth;

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: that he pleased the Blessed One, and did not displease him; and that he went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship?

source: ནོངས་དམིགས་ཅི་ཞིག་མཐོང་ན་བྱིས་པ་ནས་འདུ་འཛི་སྤངས་ཏེ་གཅིག་པུ་མཆིས་པར་དགའ་བར་གྱུར་ལགས།
en: What fault did he recognize that even as a child he rid himself of such socializing, and was happy to be by himself?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ནི་རང་བཞིན་གྱིས་ཚེ་རབས་དྲན་ལ། འཁོར་བར་འཁོར་བ་ན་འདིས་འདུ་འཛིའི་ཉེས་པས་སྡུག་བསྔལ་ཆེན་པོ་ཡང་མྱོང་བར་གྱུར་ཏེ
en: “Monks,” the Blessed One explained, “he began to naturally recall his former lives and saw that he had been circling in saṃsāra, where caught up in socializing he met with great suffering.

source: འདིས་སྡུག་བསྔལ་དེ་རྗེས་སུ་དྲན་པས་ན་གཅིག་པུ་གནས་པར་དགའ་བར་གྱུར་ཏོ། །
en: Recollecting this suffering, he was happy to be by himself.”

source: བཙུན་པ་འདིས་གང་དུ་འདུ་འཛིའི་ཉེས་པ་བསྐྱེད་ལགས།
en: “Lord, where did he become caught up in socializing?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, he went forth in his doctrine.

source: དགེ་སློང་ཞལ་ཏ་བྱེད་པ་འདུ་འཛི་མང་བར་གྱུར་ནས།
en: “Serving as steward the monk became caught up in socializing.

source: འདུ་འཛིའི་ཉེས་པ་དེས་ཚུལ་ཁྲིམས་འཆལ་པར་གྱུར་ཏེ། ཚུལ་ཁྲིམས་འཆལ་པ་དང་། དེས་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་། འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་མ་ཐུབ་ནས། ཅི་འདོད་པར་སྤྱད་དེ་གཞན་དག་ལ་ཡང་བྱིན་ནོ། །
en: Because he became caught up in socializing, he forsook his morality, and when he forsook his morality he took all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions, and, indulging himself as he pleased, also gave them to others.

source: དེའི་ཚེ་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། དགེ་སློང་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was serving as steward then is none other than this monk.

source: དེ་དེར་རབ་ཏུ་བྱུང་ནས་དགེ་འདུན་གྱི་དཀོར་དང་མཆོད་རྟེན་གྱི་དཀོར་དང་འཚོ་བ་ནར་མ་དང་ཕྱོགས་བཞིའི་དགེ་འདུན་གྱི་དཀོར་མ་ཐུབ་ནས། ཅི་འདོད་པར་སྤྱད་དེ། གཞན་དག་ལ་ཡང་བྱིན་ནས།
en: At that time he went forth, but he took all the donations for the saṅgha, the donations to the stūpa, their regular support, and the donations for the saṅgha of the four directions, and, indulging himself as he pleased, also gave them to others.

source: ཁོང་དགེ་བ་རྣམས་ལ་ངོར་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། འདི་ཚེ་རབས་ལྔ་བརྒྱར་ཡི་དགས་སུ་སྐྱེས་ཏེ་སྡུག་བསྔལ་ཆེན་པོ་ཉམས་སུ་མྱོང་ངོ་། །
en: The act of tossing virtue aside ripened such that for five hundred lifetimes he took rebirth as an anguished spirit, and underwent great suffering.

source: དེས་སྡུག་བསྔལ་དེ་རྗེས་སུ་དྲན་པས་ན་གཅིག་པུ་གནས་པར་དགའ་བར་གྱུར་ཏོ། །
en: “Once he recalled his previous sufferings, he was happy to be by himself.

source: དེས་དེར་ཚེ་གཅིག་གི་བར་དུ་ཚངས་པར་སྤྱོད་པ་ལ་གནས་པ་བསྲུངས་པ་དང་། དབང་པོ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ནི་ད་ལྟར་འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ་ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: At that time he practiced pure conduct all his life, his faculties ripened, and now he has pleased me, not displeased me, gone forth in my very doctrine, cast away all afflictive emotions, and manifested arhatship.

source: དེས་ཅུང་ཟད་ཆོས་བཞིན་དུ་ཞལ་ཏ་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ནི། ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་སོ།། །།
en: What little service he did offer in accord with the Dharma ripened into his birth into a family of great means, prosperity, and wealth.”

source: གླང་པོ་ཆེ་ཞེས་བྱ་བ་ནི།
en: The Elephant

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་དུ་ཡོད་པ་ན་དབྱར་གནས་བཅས་ཏེ།
en: When the Blessed One was in Śrāvastī he held his summer rains retreat there.

source: དབྱར་ཟླ་བ་གསུམ་འདས་ནས་ཆོས་གོས་མཛད་དེ། ཆོས་གོས་ཟིན་ནས་ཆོས་གོས་གསོལ་ཏེ།
en: After the three months of rain had passed, he prepared his Dharma robes, put them on,

source: ལྷུང་བཟེད་བསྣམས་ནས། མཉན་དུ་ཡོད་པ་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་ཆས་ཏེ་གཤེགས་ནས།
en: and, carrying his alms bowl, set out from Śrāvastī for Rājagṛha.

source: མཐར་གྱིས་གཤེགས་གཤེགས་པ་ལས་རི་དྲུང་ཤོད་ཅིག་ཏུ་བྱོན་པ་དང་།
en: He traveled and traveled until he eventually came to the foot of a mountain.

source: དེའི་ཚེ་དགོན་པའི་གླང་པོ་ཆེ་ཞིག་སེང་གེས་འཇིགས་ནས་རང་གི་ཁྱུ་དེད་དེ། རི་དེ་ལ་འཛེགས་ནས་རང་གི་ཁྱུ་སྐྱོང་ཞིང་འདུག་པ་ལས།
en: At that time there was a certain forest elephant who was afraid of lions and had driven his herd up onto the mountain, where he looked after them.

source: གླང་པོ་ཆེའི་གཙོ་བོ་རི་ལ་སོང་བ་དེས་བཅོམ་ལྡན་འདས་ཐག་རིང་པོ་ཞིག་ནས་གཤེགས་པ་མཐོང་ནས།
en: After he ascended the mountain, the elephant bull saw the Blessed One approaching in the distance.

source: བཅོམ་ལྡན་འདས་མཐོང་མ་ཐག་ཏུ་གླང་པོ་ཆེའི་གཙོ་བོ་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་སྐྱེས་ནས། དེ་རི་དེ་ལས་བབས་ཏེ་
en: No sooner had the elephant bull seen him than a feeling of joy toward the Blessed One surged within him and he descended the mountain.

source: ཤིང་ནྱ་གྲོ་དྷའི་ཡལ་ག་དག་ཁྱེར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Bearing banyan branches, he went to the Blessed One,

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་ཉི་མའི་འོད་ཀྱིས་གདུང་བར་མི་འགྱུར་བར་བྱ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་ཀྱི་སྟེང་དུ་ནྱ་གྲོ་དྷའི་ཡལ་ག་འཛིན་ཅིང་ཕྱི་བཞིན་འབྲང་ངོ་། །
en: and, after bowing to the Blessed One and circumambulating him, he held the banyan branches aloft so that the bright sun would not torment his body, and followed him.

source: དེ་ནས་གྲོང་གཞན་དུ་གཤེགས་ཀྱི་བར་དུ་བསྐྱལ་ཏེ།
en: He escorted him until they came to the next village,

source: ཕྱིར་ལོག་ནས་དེ་ཕྱིར་ལྡོག་ཅིང་འོང་བ་ན། རི་དགས་ཀྱི་རྒྱལ་པོ་སེང་གེས་བསད་དེ་དེ་ཤི་འཕོས་ནས་དུས་ལས་འདས་པའི་འོག་ཏུ་ལྷའི་ནང་དུ་སྐྱེས་ཏེ།
en: and on his way back a lion, the king of beasts, killed him. After he died he transmigrated and took rebirth among the gods.

source: དེ་ནས་དུད་འགྲོ་ལས་ཤི་འཕོས་པ་དང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་ཡུལ་བཟང་པོར་སྐྱེས་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་པར་དེས་མཐོང་ངོ་། །དེ་ནས་སྔོན་གླང་པོ་ཆེར་གྱུར་པའི་ལྷའི་བུ་དེ་
en: The young god who formerly was the elephant saw that when he died from his life as an animal, filled with joy at the thought of the Blessed One, he transmigrated and took rebirth in a higher state as a god in the Heaven of the Thirty-Three.

source: འདི་སྙམ་དུ་སེམས་ཏེ།
en: Then he thought,

source: བདག་ཞག་ལོན་ནས་གཟོད་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་འགྲོ་བ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས།
en: “It’s been a whole day since I approached the Blessed One and offered him my respect.

source: བདག་ཞག་མ་ལོན་པར་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་འགྲོ་སྙམ་མོ། །
en: This isn’t proper of me. Not a day should pass without my seeing the Blessed One.”

source: དེ་ནས་སྔོན་གླང་པོ་ཆེར་གྱུར་པའི་ལྷའི་བུ་རྣ་ཆ་གདུབ་ཀོར་དག་ཅིང་འགུལ་པ་ཐོགས་པ་ལུས་དོ་ཤལ་དང་སེ་མོ་དོས་བརྒྱན་པ་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པའི་ཅོད་པན་ཅན། ལུས་གུར་གུམ་དང་ཏ་མ་ལའི་ལོ་མ་དང་སྤྲི་ཀ་ལ་སོགས་པས་བྱུགས་པ་དེས།
en: So the young god who formerly was the elephant decorated himself with earrings, garlands, and strings of precious stones, put on a crown decorated with various types of precious jewels, and perfumed his body with saffron, tamala, spṛka, and other herbs.

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ཐམས་ཅད་འོད་ཆེན་པོས་སྣང་བར་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་མེ་ཏོག་གིས་གཏོར་ཏེ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ། །
en: Then, appearing amid a great light in the garden of Prince Jeta, he approached the Blessed One, scattered the divine blue lotus, lotus, white water lily, white lotus, and mandārava flowers over the Blessed One, and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྔོན་གླང་པོ་ཆེར་གྱུར་པའི་ལྷའི་བུའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་རང་བཞིན་ཐུགས་སུ་ཆུད་ནས།
en: The Blessed One directly apprehended the thoughts, habitual tendencies, temperament, and nature of the young god who formerly was the elephant,

source: འཕགས་པའི་བདེན་པ་བཞི་རྟོགས་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་བསྟན་ཏེ།
en: and taught him the Dharma in such a way that he realized the noble truths of noble beings.

source: དེ་ཐོས་ནས་སྔོན་གླང་པོ་ཆེར་གྱུར་པའི་ལྷའི་བུས་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་སྟེ
en: Hearing it, the young god who formerly was the elephant destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry.

source: དེས་བདེན་པ་མཐོང་ནས་དགའ་བའི་ཚིག་ལན་གསུམ་བརྗོད་དེ།
en: Having seen the truths, he expressed his joy three times, saying,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་གི་ཁྲག་དང་མཆི་མའི་རྒྱ་མཚོ་བསྐམས་པ་དང་། རུས་པའི་ལ་བརྒལ་བ་དང་། ངན་སོང་གི་སྒོ་རྣམས་བཅད་པ་དང་། མཐོ་རིས་དང་ཐར་པའི་སྒོ་རྣམས་ཕྱེ་བ་དང་།
en: “Lord, Blessed One, when you dried up the ocean of my blood and tears, led me over the mountain pass of bones, slammed shut the doors to lower births, and swung wide the doors to heaven and liberation,

source: བདག་ལྷ་དང་མི་རྣམས་ཀྱི་ནང་དུ་བཞག་པ་འདི་ལྟ་བུ་ནི་བདག་ལ་ཕས་ཀྱང་མ་བགྱིས་མས་ཀྱང་མ་བགྱིས་རྒྱལ་པོས་ཀྱང་མ་བགྱིས་ལྷ་རྣམས་ཀྱིས་ཀྱང་མ་བགྱིས་ནང་མི་དང་གཉེན་གྱི་ཚོགས་རྣམས་ཀྱིས་ཀྱང་མ་བགྱིས།
en: you established me among gods and human beings, which no one has ever done for me—which neither my father and mother, nor a sovereign, nor deities, nor my relatives and all my friends,

source: སྔོན་གྱི་མཚུན་རྣམས་ཀྱིས་ཀྱང་མ་བགྱིས་དགེ་སྦྱོང་དང་བྲམ་ཟེ་རྣམས་ཀྱིས་ཀྱང་མ་བགྱིས་ལགས་སོ། །
en: nor my ancestors before me could do, and that neither the ascetics nor the brahmins could do.”

source: ཡང་སྨྲས་པ།
en: He continued:

source: ཉེས་པ་མང་པོར་ལྡན་པའི་ངན་སོང་ལམ། །ཤིན་ཏུ་མི་བཟད་ཁྱོད་ཀྱི་མཐུ་ཡིས་བཅད། །
en: “With force you cleaved the path I walked, Fraught with evil, leading to lower births.

source: བསོད་ནམས་རབ་ལྡན་མཐོ་རིས་འགྲོ་བ་ཕྱེ། །མྱ་ངན་འདས་པའི་ལམ་ཡང་བདག་གིས་ཐོབ། །
en: You unbarred the way to heavens of high merit, That I might attain the sorrowless way.

source: བདག་གིས་དེ་རིང་ཉེས་པ་སྤངས་པའི་མིག །ཤིན་ཏུ་རྣམ་དག་ཁྱོད་ལ་བརྟེན་ནས་ཐོབ། །
en: “With your support, today I have gained The clearest vision, pure of faults.

source: བདག་ནི་སྡུག་བསྔལ་རྒྱ་མཚོ་ཕ་རོལ་རྒལ། །
en: I shall bridge a sea of misery.

source: འཕགས་པ་དགྱེས་པའི་ཞི་བའི་གོ་འཕང་འཐོབ། །
en: I shall gain the peaceful state that so delights the noble ones.

source: མི་མཆོག་དབང་པོ་མི་དང་ལྷས་མཆོད་པ། །སྐྱེ་དང་རྒ་དང་འཆི་བའི་ནད་སྤངས་པ། །
en: “You whom humans and gods alike revere— You’ve nary an ailment: birth, aging, or death;

source: སྲིད་པ་སྟོང་དུ་མཐོང་བར་དཀའ་བ་ཡི། །ཐུབ་པ་ཁྱོད་ནི་དེང་མཐོང་འབྲས་བུ་ཡོད། །
en: It is hard to behold you in even a thousand lifetimes, But today, O Sage, I see you and my life bears fruit.”

source: དེ་ནས་དོ་ཤལ་འཕྱང་བ་དགར་གྱུར་ཏེ། །བཏུད་ཅིང་ཞབས་གཉིས་ལ་ནི་ཕྱག་འཚལ་ནས། །
en: Then he removed his garland, Bowed and prostrated at the Blessed One’s feet,

source: དགྲ་ཐུབ་ལ་ནི་བསྐོར་བ་བྱས་ནས་ཀྱང་། །ལྷ་ཡི་འཇིག་རྟེན་ཁ་བལྟས་ལྷ་ཡུལ་སོང་། །
en: Walked around the Victor in a gesture of respect, Turned his face to the world of gods, and flew home.

source: དེ་ནས་སྔོན་གླང་པོ་ཆེར་གྱུར་པའི་ལྷའི་བུ་དེ་ཚོང་པ་ཁེ་སྤོགས་ཕྱིན་པ་དང་། ཞིང་པ་འབྲུ་རྒྱལ་བར་གྱུར་པ་དང་། དཔའ་བོ་གཡུལ་ལས་རྒྱལ་བ་དང་། ནད་པ་ནད་ཐམས་ཅད་ལས་ཐར་བ་བཞིན་དུ་འབྱོར་པ་གང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་འོངས་པའི་འབྱོར་པ་དེ་ཉིད་ཀྱིས་རང་གི་གནས་སུ་སོང་ངོ་། །
en: When the young god who was formerly the elephant returned to where he belongs, the rewards of having met the Blessed One were like the profits of a merchant, the success of a farmer in the field, the victory of a national hero, and the liberation at last of the sick from any illness.

source: དེའི་ཚེ་དགེ་སློང་སྲོད་དང་ཐོ་རངས་མི་ཉལ་བར་བརྩོན་པ་ལྷུར་བྱེད་པ་ལ་གནས་པ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་སྣང་བ་ཆེན་པོ་བྱུང་བ་མཐོང་ངོ་། །
en: At that time, the monks who were committed to earnest practice, foregoing sleep from dusk to dawn, noticed all the great rays of light spreading forth from where the Blessed One was.

source: མཐོང་ནས་ཀྱང་ཐེ་ཚོམ་སྐྱེས་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: They were bewildered at the sight, and inquired of the Blessed Buddha,

source: བཅོམ་ལྡན་འདས་ཅི་ལགས།
en: “Lord, what was this?

source: མདང་སུམ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ་འཇིག་རྟེན་སྐྱོང་བ་བཞི་བཅོམ་ལྡན་འདས་བལྟ་བའི་ཕྱིར་མཆིས་ལགས་སམ།
en: Last night, did Sahāṃpati Brahmā, or Śakra, King of the Gods—or perhaps the four great kings—come to offer respect to the Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པའམ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ནམ་འཇིག་རྟེན་སྐྱོང་བ་བཞི་ང་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་མ་ཡིན་ཏེ
en: “Monks,” the Blessed One replied, “it was neither Sahāṃpati Brahmā, nor Śakra, King of the Gods, nor the four great kings who came to see me.

source: ཁྱོད་ཀྱིས་གླང་པོ་ཆེའི་གཙོ་བོ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ལམ་དུ་འགྲོ་བའི་སྟེང་དུ་ནྱ་གྲོ་དྷའི་ཡལ་ག་བཟུང་བ་མཐོང་ངམ།
en: Did you see the elephant bull who held the banyan branches as the Tathāgata was walking on the road?”

source: དགེ་སློང་དག་དེ་ནི་ངའི་ཐད་ནས་ཕྱིར་ལོག་པའི་འོག་ཏུ་སེང་གེས་བསད་དེ།
en: “Monks, on the way back he was killed by a lion.

source: དེ་ང་ལ་སེམས་དགའ་བ་བསྐྱེད་པས་ལྷའི་ནང་དུ་སྐྱེས་ཏེ་ལྷར་གྱུར་ནས་ངའི་ཐད་དུ་འོངས་ཏེ།
en: Having felt such joy toward me, he took rebirth among the gods and came here to see me.

source: དེ་ལ་ངས་ཆོས་བསྟན་ནས་དེས་བདེན་པ་མཐོང་སྟེ་རང་གི་གནས་སུ་སོང་ངོ་། །
en: I taught the Dharma to that young god, and, having seen the truths, he returned to where he belongs.”

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ་བཙུན་པ་
en: “Lord,” the monks inquired of the Blessed Buddha,

source: ལས་ཅི་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་ལྷའི་ནང་དུ་སྐྱེས་ལ། དེས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ལ་མི་མཉེས་པར་མ་བགྱིས་ལགས།
en: “what action did he take that ripened into his birth among the gods, and that he pleased the Blessed One, and did not displease him?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདས་པའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་ལ། ད་ལྟར་བྱུང་བའི་ལས་ཀྱི་ཤས་ཀྱང་ཡོད་དེ
en: “Monks,” the Blessed One replied, “it was partly due to his past actions, and it is partly due to his present actions as well.

source: འདས་པའི་ལས་གང་ཞེ་ན། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ། སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ནས་
en: “As for his past actions, monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, he went forth in his teaching.

source: དགེ་སློང་བསླབ་པ་ལ་མ་གུས་ཤིང་གཡེལ་བར་གྱུར་ཏེ།
en: “As a monk, he had no respect for his training and became caught up in distractions.

source: དེས་དེར་བསླབ་པའི་གཞི་ཆེ་ཕྲ་ལས་འགལ་བ་མང་དུ་བྱས་སོ། །
en: He did much that violated the fundamental precepts, both lesser and greater.
